app/views/contacts/_form.html.erb

SELECT "media".* FROM "media"
---
  	<div class = 'col-sm-6'>
      <%= f.association :media, label: false, as: :check_boxes, collection: Medium.all.to_a, label_method: :name  %>

SELECT "contenttypes".* FROM "contenttypes"
---
    <div class = 'col-sm-6'>
      <%= f.association :contenttypes, label: false, as: :check_boxes, collection: Contenttype.all.to_a, label_method: :name  %>