app/views/contacts/index.html.erb

            <td><%= contact.name %></td>
            <td><%= contact.media.map(&:name).sort.join(", ") %></td>
            <td><%= contact.contenttypes.map(&:name).sort.join(", ") %></td>
---
SELECT "media".* FROM "media" INNER JOIN "contacts_media" ON "media"."id" = "contacts_media"."medium_id" WHERE "contacts_media"."contact_id" = $1  [["contact_id", 1]]
SELECT "contenttypes".* FROM "contenttypes" INNER JOIN "contacts_contenttypes" ON "contenttypes"."id" = "contacts_contenttypes"."contenttype_id" WHERE "contacts_contenttypes"."contact_id" = $1  [["contact_id", 1]]