app/controllers/contenttypes_controller.rb

    def index
      @contenttypes = Contenttype.all
---
SELECT "contenttypes".* FROM "contenttypes"

  	def show
      @contenttype = Contenttype.find(params[:id])
---
SELECT  "contenttypes".* FROM "contenttypes" WHERE "contenttypes"."id" = $1 LIMIT 1  [["id", 1]]

  	def edit
      @contenttype = Contenttype.find(params[:id])
---
SELECT  "contenttypes".* FROM "contenttypes" WHERE "contenttypes"."id" = $1 LIMIT 1  [["id", 1]]

    def create
      @contenttype = Contenttype.new(contenttype_params)
      if @contenttype.save
---
INSERT INTO "contenttypes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Acquarium"], ["created_at", "2016-03-13 23:34:27.140637"], ["updated_at", "2016-03-13 23:34:27.140637"]]

  	def update
    	@contenttype = Contenttype.find(params[:id])
---
SELECT  "contenttypes".* FROM "contenttypes" WHERE "contenttypes"."id" = $1 LIMIT 1  [["id", 1]]