app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Dog"], ["created_at", "2016-03-13 23:05:01.325682"], ["updated_at", "2016-03-13 23:05:01.325682"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "Cat"], ["updated_at", "2016-03-13 23:24:50.559578"], ["id", 1]]
---
  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)